# <center>  More on Data Preperation with Pandas </center>

## Agenda 

- [1- Setting index in a dataframe](#set_index) 
- [2- Resetting index in a dataframe](#reset_index)
- [3- Save dataframe into a csv file](#to_csv)
- [4- Concatenate two columns in a dataframe](#df.col.str.cat)

<a id='set_index'> </a>

### Setting index in a dataframe [[Ref.](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.set_index.html)

In [32]:
import pandas as pd

df = pd.DataFrame({'Salary': ['80K','50K', '60K', '95K'],
                   'Name': ['Mike', 'Dave', 'Sara', 'Doug'],
                   'Birth':[1982, 1985, 1973, 1970]})
df.head()

  Salary  Name  Birth
0    80K  Mike   1982
1    50K  Dave   1985
2    60K  Sara   1973
3    95K  Doug   1970

In [33]:
df.set_index('Name', inplace=True)

df.head()

     Salary  Birth
Name
Mike    80K   1982
Dave    50K   1985
Sara    60K   1973
Doug    95K   1970

<a id='reset_index'> </a>

### Resetting index in a dataframe

In [34]:
df.reset_index(inplace=True)   

df.head()

   Name Salary  Birth
0  Mike    80K   1982
1  Dave    50K   1985
2  Sara    60K   1973
3  Doug    95K   1970

<a id='df.col.str.cat'> </a>

### 3- Save dataframe into a csv file

In [ ]:
df.to_csv('C:\\Users\\...')

<a id='to_csv'> </a>

### 4- Concatenate two columns in a dataframe

In [38]:
df['New']=df['Salary'].str.cat(df['Name'], sep=' ')

df.head()

   Name Salary  Birth       New
0  Mike    80K   1982  80K Mike
1  Dave    50K   1985  50K Dave
2  Sara    60K   1973  60K Sara
3  Doug    95K   1970  95K Doug